{
  "account": "@FaytuksNetwork",
  "scraped": "2026-01-17T19:38:20.333Z",
  "period": "3 weeks",
  "count": 386,
  "tweets": [
    {
      "text": "Israeli Channel 12, quoting senior US officials, says that an attack on Iran will happen and that it is only a matter of time.",
      "date": "2026-01-17T18:14:41.000Z"
    },
    {
      "text": "President Trump, after being read hostile posts from Ayatollah Khamenei’s X account, said Iran’s rulers govern through repression and violence, accusing Khamenei of destroying the country and saying “leadership is about respect, not fear and death.”",
      "date": "2026-01-17T16:33:13.000Z"
    },
    {
      "text": "Trump says thousands of protesters were killed in Iran, a claim he made explicitly for the first time.",
      "date": "2026-01-17T16:34:43.000Z"
    },
    {
      "text": "BREAKING: Trump calls for new leadership in Iran - POLITICO interview",
      "date": "2026-01-17T16:22:31.000Z"
    },
    {
      "text": "Iran’s Supreme Leader Ayatollah Ali Khamenei says Iran considers the U.S. president “criminally responsible” for casualties, damages, and what he called false accusations against the Iranian nation, according to Mehr News.",
      "date": "2026-01-17T10:04:48.000Z"
    },
    {
      "text": "Over 3,090 confirmed killed amidst Iran's protests, with 3,882 more cases under investigation - HRANA",
      "date": "2026-01-17T05:29:10.000Z"
    },
    {
      "text": "BREAKING: Massacres in Tehran on January 8th and 9th were mainly carried out by the IRGC's Quds Force and their proxy forces from Pakistan, Iraq and Afghanistan - Iran International",
      "date": "2026-01-17T01:40:50.000Z"
    },
    {
      "text": "BREAKING: Internet has been partially restored in Iran",
      "date": "2026-01-17T01:13:14.000Z"
    },
    {
      "text": "NEW: Iranian state-affiliated media reporting that SMS messaging is returning in Iran",
      "date": "2026-01-16T21:42:09.000Z"
    },
    {
      "text": "BREAKING: At least 52 prisoners have been executed in 42 Iranian prisons in the last two weeks - HRANA",
      "date": "2026-01-16T20:59:51.000Z"
    },
    {
      "text": "European Union Aviation Safety Agency says the potential for U.S. military action has put Iranian air defence forces on heightened alert, raising the risk of misidentification within Tehran FIR.",
      "date": "2026-01-16T18:53:08.000Z"
    },
    {
      "text": "President Trump says \"no one convinced [him]\" and that he convinced himself when asked whether Arab and Israeli officials convinced him not to strike Iran, per NewsNation.",
      "date": "2026-01-16T18:22:39.000Z"
    },
    {
      "text": "Trump on Truth Social: \"I greatly respect the fact that all scheduled hangings, which were to take place yesterday (Over 800 of them), have been cancelled by the leadership of Iran. Thank you!\"",
      "date": "2026-01-16T17:41:14.000Z"
    },
    {
      "text": "NEW: President Trump spoke again by phone on Thursday with Israeli PM Netanyahu about Iran, their second call in two days. - Axios",
      "date": "2026-01-16T17:24:56.000Z"
    },
    {
      "text": "An Israeli source says that beyond concerns about retaliation, the current U.S. plan includes strikes on Iranian security force targets. However, Israel does not view the plan as strong enough to meaningfully destabilize the regime - Axios",
      "date": "2026-01-16T11:13:49.000Z"
    },
    {
      "text": "Mossad director visits U.S. for Iran consultations - Axios",
      "date": "2026-01-16T11:13:04.000Z"
    },
    {
      "text": "Russian President Putin and Israeli Prime Minister Netanyahu discussed the Middle East and Iran, with Putin stressing political and diplomatic steps to ensure regional stability and offering Russia’s continued mediation, the Kremlin said.",
      "date": "2026-01-16T09:36:54.000Z"
    },
    {
      "text": "Trump wanted to carry out a rapid, powerful, one-time strike on Iran to collapse the regime, but his advisors could not guarantee it would be quick or it would collapse the regime. \n\nThe US has transitioned for now to a diplomatic path- however the US attack was postponed, not",
      "date": "2026-01-16T05:36:53.000Z"
    },
    {
      "text": "BREAKING: US special envoy Steve Witkoff outlines four demands and asks Iran to \"return to the League of Nations,\" threatens a \"bad alternative\"",
      "date": "2026-01-16T04:26:59.000Z"
    },
    {
      "text": "Iran’s ambassador to the UN Security Council says the U.S. “should be ashamed,” claiming armed terrorists are hijacking and destroying protests in Iran – BBC News",
      "date": "2026-01-16T02:32:59.000Z"
    },
    {
      "text": "U.S. intelligence indicates Iran is planning retaliation against U.S. targets in Iraq and Syria if it is attacked - CNN",
      "date": "2026-01-16T02:26:08.000Z"
    },
    {
      "text": "Trump wants to avoid a longer commitment in Iran - CNN",
      "date": "2026-01-16T02:21:41.000Z"
    },
    {
      "text": "U.S. intelligence had not indicated the killings had stopped [in Iran] at the time Trump said they had in the Oval Office - CNN",
      "date": "2026-01-16T02:10:33.000Z"
    },
    {
      "text": "The head coach of Esteghlal FC, Iran's most decorated football club, says he has taken refuge in the Portuguese Embassy in Tehran as several of his players and staff have fled the country",
      "date": "2026-01-15T19:57:05.000Z"
    },
    {
      "text": "Netanyahu told Trump to wait as Israel needs more time to prepare, and Israel does not see the current US plan against Iran as strong or effective enough - Axios",
      "date": "2026-01-15T19:11:28.000Z"
    },
    {
      "text": "According to The New York Times Netanyahu asked Trump to delay the attack, fearing that Israel was not ready for an Iranian response.",
      "date": "2026-01-15T19:01:21.000Z"
    },
    {
      "text": "Claims from hardliner politicians in Iran that former Iranian president Hassan Rouhani and JCPOA architect Javad Zarif were arrested are fake news - Amwaj media",
      "date": "2026-01-15T17:13:17.000Z"
    },
    {
      "text": "NewsNation corroborates earlier reporting that Gulf states worked to convince Trump to \"give Iran a chance.\"",
      "date": "2026-01-15T16:46:07.000Z"
    },
    {
      "text": " The U.S. Treasury imposed sanctions on senior Iranian security officials involved with the nation's violent crackdown on demonstrators, including Ali Larijani, and 18 individuals and entities tied to Bank Melli and Shahr Bank.",
      "date": "2026-01-15T15:56:37.000Z"
    },
    {
      "text": "BREAKING: Iran's Pakistan envoy tells Pakistan-based Dawn News Trump informed Iran he does not intend to attack",
      "date": "2026-01-15T12:09:16.000Z"
    },
    {
      "text": "Qatar, Saudi Arabia, and Oman have lobbied the Trump administration against striking Iran, per the NYT, citing fears that \"regime change\" could destabilize the region and allow Israel to move to fill that “vacuum.”",
      "date": "2026-01-15T11:41:19.000Z"
    },
    {
      "text": "Trump posts on Truth Social: “FoxNews: “Iranian protester will no longer be sentenced to death after President Trump’s warnings. Likewise others.” This is good news. Hopefully, it will continue!”",
      "date": "2026-01-15T11:28:05.000Z"
    },
    {
      "text": "A senior Iranian official said Iran had told regional countries hosting US bases, such as Saudi Arabia and Turkey, that it would attack those bases in the event of a US strike - The Guardian",
      "date": "2026-01-15T05:52:42.000Z"
    },
    {
      "text": "US Secretary of the Treasury Scott Bessent says that \"millions of dollars are being smuggled out of [Iran] by the leadership of the Islamic Republic\" and that the US is \"tracking this money\"",
      "date": "2026-01-15T03:40:38.000Z"
    },
    {
      "text": "Iran-related thread.\n\nStarting at 20:02 UTC, a pair of USAF C-17As set to depart from Al-Udeid AB, Qatar (OTBH) were instructed to \"return to the chalks\" and that their mission to Chania, Greece (LGSA) had been scrubbed. They were instructed then to wait for more info. \n\n1/",
      "date": "2026-01-15T02:48:55.000Z"
    },
    {
      "text": "BREAKING: Iran recently told Qatar they would strike them in retaliation if the US struck Iran, a senior official says - Washington Post",
      "date": "2026-01-15T02:34:13.000Z"
    },
    {
      "text": "Trump told his national security team what he wants any US military action in Iran to \"achieve\" on Tuesday, and the Defense Department presented Trump with tailored options to meet his stated objectives on Wednesday.\n\nOne US official says Trump is ready to follow through on his",
      "date": "2026-01-15T01:27:14.000Z"
    },
    {
      "text": "BREAKING: Airspace closure over Iran extended to 03:30 UTC",
      "date": "2026-01-15T01:18:40.000Z"
    },
    {
      "text": "Trump questioned whether Iranian opposition figure Reza Pahlavi would have enough support inside Iran to lead the country - Reuters",
      "date": "2026-01-15T01:10:10.000Z"
    },
    {
      "text": "The US has called for an emergency UN Security Council meeting on the situation in Iran, according to diplomats - Al Jazeera",
      "date": "2026-01-15T00:58:47.000Z"
    },
    {
      "text": "NBC reports Trump wants any U.S. action on Iran to be “swift” and “decisive.”",
      "date": "2026-01-15T00:55:45.000Z"
    },
    {
      "text": "Air India: Due to the developing situation in Iran, flights that normally overfly the region are taking alternate routes, which could cause delays.",
      "date": "2026-01-15T00:06:07.000Z"
    },
    {
      "text": "Iran FM Abbas Araghchi to Trump: “Don’t make the same mistake you made in June. You failed in June, and you’ll get the same result.”",
      "date": "2026-01-14T23:23:38.000Z"
    },
    {
      "text": "Iran FM Abbas Araghchi claims the protests were peaceful for ten days and says authorities “tolerated” them, but alleges they later turned into a “terrorist operation.”",
      "date": "2026-01-14T23:22:53.000Z"
    },
    {
      "text": "Iran FM Abbas Araghchi says Iran has negotiated with the U.S. several times but calls each round a “very negative experience,” asking: “Why should we negotiate with the United States?”",
      "date": "2026-01-14T23:21:11.000Z"
    },
    {
      "text": "Iran FM Abbas Araghchi says Iran has “every right” to conduct nuclear enrichment, insisting it is for peaceful purposes.",
      "date": "2026-01-14T23:20:16.000Z"
    },
    {
      "text": "Iran FM Abbas Araghchi says there will be no hangings “today or tomorrow,” but says he can’t confirm what may happen on Friday.",
      "date": "2026-01-14T23:17:50.000Z"
    },
    {
      "text": "Iran FM Abbas Araghchi says “a war was started against us,” calling threats from Trump and European officials “normal wartime rhetoric,” and says Iran views Jan. 8–10 as a continuation of the earlier 12-day war.",
      "date": "2026-01-14T23:17:06.000Z"
    },
    {
      "text": "BREAKING NEWS: Iran issues NOTAM to close all airspace",
      "date": "2026-01-14T22:19:32.000Z"
    },
    {
      "text": "A Western official says all signals are that a \"US attack [on Iran] is imminent\" - Reuters",
      "date": "2026-01-14T22:05:54.000Z"
    },
    {
      "text": "The report on Israel-Iran dialogue via Russia originates from December 2025, before the Iran protests even began, and arose due to Israeli concerns Iran was preparing a preemptive strike.\n\nIt is safe to say the situation has seriously changed since then.",
      "date": "2026-01-14T21:24:58.000Z"
    },
    {
      "text": "\"There is a signal tonight from the British government that unspecified US/Trump action against Iran is imminent\" - ITV News",
      "date": "2026-01-14T21:13:44.000Z"
    },
    {
      "text": "Utter confusion on Iran among senior diplomats according to WSJ reporter Laurence Norman.",
      "date": "2026-01-14T20:44:05.000Z"
    },
    {
      "text": "Trump: Iran said they were shooting back at people with guns...you know, its one of those things",
      "date": "2026-01-14T20:38:18.000Z"
    },
    {
      "text": "BREAKING: British Embassy in Tehran has been temporarily closed – Politico",
      "date": "2026-01-14T20:09:50.000Z"
    },
    {
      "text": "Trump: “I’ve been told the killing in Iran is stopping. There are no plans for executions.”",
      "date": "2026-01-14T20:04:45.000Z"
    },
    {
      "text": "Spain recommends its' citizens to leave Iran and discourages travel there.",
      "date": "2026-01-14T20:03:20.000Z"
    },
    {
      "text": "Germany has called on its nationals to leave Iran and avoid travel there, citing the risk of arbitrary arrests and an extremely volatile security situation.",
      "date": "2026-01-14T19:45:59.000Z"
    },
    {
      "text": "https://auswaertiges-amt.de/de/reiseundsicherheit/iransicherheit-202396…",
      "date": "2026-01-14T19:46:00.000Z"
    },
    {
      "text": "Poland’s Foreign Ministry urges Polish citizens to leave Iran immediately, citing security concerns – Reuters",
      "date": "2026-01-14T19:20:34.000Z"
    },
    {
      "text": "Italy urges its citizens to leave Iran immediately, citing security concerns, the Foreign Ministry says",
      "date": "2026-01-14T19:19:40.000Z"
    },
    {
      "text": "Dozens of vessels bound for Iran have dropped anchor in open waters and are holding position instead of entering Iranian ports - Reuters reports.",
      "date": "2026-01-14T18:50:56.000Z"
    },
    {
      "text": "Turkmenistan MFA says its coast guard and emergency services rescued 14 crew from the distressed Iranian-flagged cargo ship Rona in the Caspian Sea after an SOS call.",
      "date": "2026-01-14T18:48:07.000Z"
    },
    {
      "text": "BREAKING: Martial law conditions in place in Iran - Iran International",
      "date": "2026-01-14T18:09:48.000Z"
    },
    {
      "text": "Iran’s ambassador to Egypt tells Al Arabiya: “We are undoubtedly in a state of war,”",
      "date": "2026-01-14T17:50:20.000Z"
    },
    {
      "text": "Inside the Trump administration, officials believe no one has the authority to speak for Iran’s Supreme Leader, the ultimate decision maker, which makes diplomacy far more difficult - CNN",
      "date": "2026-01-14T17:28:17.000Z"
    },
    {
      "text": "Ali Shamkhani, a senior adviser to Iran’s Supreme Leader Ali Khamenei, said last year’s strike on a U.S. airbase in Qatar showed Iran’s “will and capability,” Al Jazeera reports.",
      "date": "2026-01-14T17:26:44.000Z"
    },
    {
      "text": "Trump has pressed Elon Musk to bolster Starlink connectivity in Iran - CNN",
      "date": "2026-01-14T17:24:56.000Z"
    },
    {
      "text": "Trump has been receiving updated lists of options for action in Iran since last week - CNN",
      "date": "2026-01-14T17:23:55.000Z"
    },
    {
      "text": "There are signs Iran’s leadership was surprised by the scale of the protests and is trying to crack down without giving foreign governments a pretext to intervene, including restricting funerals and cutting internet access - CNN",
      "date": "2026-01-14T17:22:36.000Z"
    },
    {
      "text": "A source familiar with the talks [about Iran] says the president is “almost certainly” going to act - CNN",
      "date": "2026-01-14T17:22:14.000Z"
    },
    {
      "text": "NEW: Officials say Trump now feels obligated to follow through on strikes against Iran - CNN",
      "date": "2026-01-14T17:21:24.000Z"
    },
    {
      "text": "Recent U.S. intel reporting indicate Iran is preparing options to target American bases in the Middle East, including those in Iraq & Syria, if Trump carries out military strikes, two sources say - CNN",
      "date": "2026-01-14T17:20:53.000Z"
    },
    {
      "text": "“Saudi Arabia has informed Tehran directly that it will not be part of any military action taken against it, and that its territory and airspace will not be used for that purpose,” a source close to the Saudi military tells AFP",
      "date": "2026-01-14T17:07:30.000Z"
    },
    {
      "text": "The commander-in-chief of Iran’s Revolutionary Guards says the IRGC is at peak readiness and will deliver a decisive response to any “miscalculation” by the enemy - Tasnim",
      "date": "2026-01-14T16:48:52.000Z"
    },
    {
      "text": "A list of current USN combatants that are or could be tasked to CENTCOM operations, per @USNINews \n\n3 DDGs:\nUSS Roosevelt (DDG-80) - in Red Sea\nUSS Mitscher (DDG-57) - in Persian Gulf\nUSS McFaul (DDG-74) - in Persian Gulf\n\n3 LCS's, rigged for a mine countermeasure mission:\nUSS",
      "date": "2026-01-14T16:11:58.000Z"
    },
    {
      "text": "US freezes all visa processing for 75 countries, including Somalia, Russia, Iran - FOX",
      "date": "2026-01-14T14:16:05.000Z"
    },
    {
      "text": "British PM Keir Starmer condemns the \"sickening repression and murder of protesters by the \"desperate regime\" in Iran and says that the UK is working with allies on further Iran sanctions.",
      "date": "2026-01-14T13:17:22.000Z"
    },
    {
      "text": "The Indian Embassy in Tehran has urged Indian nationals to leave Iran",
      "date": "2026-01-14T10:15:33.000Z"
    },
    {
      "text": "Iran's Chief Justice says there will be fast trials and executions ahead- \"If we want to do a job, we should do it now...If we want to do something, we have to do that fast.\" - AP",
      "date": "2026-01-14T07:41:02.000Z"
    },
    {
      "text": "BREAKING: Five Iranian banks are on the brink of collapse, including Bank Sepah, one of Iran's three largest banks and the primary bank for the IRGC and Iranian military - WSJ",
      "date": "2026-01-14T03:51:32.000Z"
    },
    {
      "text": "The Iranian Central Bank is printing money to continuously loan Iranian banks, aiming to help them stay afloat. Economists say it will cause an inflationary cycle- WSJ",
      "date": "2026-01-14T04:00:57.000Z"
    },
    {
      "text": "Despite public saber-rattling, people close to the White House say Trump has been less certain in private and less enthusiastic than before the June bombings [on Iran]. One described it as “a coin flip.” - WaPo",
      "date": "2026-01-13T23:56:46.000Z"
    },
    {
      "text": "European officials say Iran is offering negotiations mainly “to stall for time.” - WaPo",
      "date": "2026-01-13T23:54:53.000Z"
    },
    {
      "text": "A European official says Iran’s leadership believes Trump would face backlash from his base if he launches attacks on Iran - WaPo",
      "date": "2026-01-13T23:54:14.000Z"
    },
    {
      "text": "NEW: European officials believe Trump may target the leadership of organizations and forces in Iran responsible for killing protesters - WaPo",
      "date": "2026-01-13T23:50:33.000Z"
    },
    {
      "text": "The U.S. asked European countries yesterday to share their intelligence on Iran, according to two European officials - Wapo",
      "date": "2026-01-13T23:48:55.000Z"
    },
    {
      "text": "Two officials say VP Vance is worried the U.S. could be “pulled deeper into a Middle East entanglement.” over Iran - Wapo",
      "date": "2026-01-13T23:47:11.000Z"
    },
    {
      "text": "JD Vance and Marco Rubio are expected to present Iran response options to Trump at the NSC meeting “without preference.” - WaPo",
      "date": "2026-01-13T23:46:46.000Z"
    },
    {
      "text": "People close to the White House say strikes on Iran would be dangerous, with U.S. military and intelligence potentially attempting “high-risk operations.” - WaPo",
      "date": "2026-01-13T23:43:40.000Z"
    },
    {
      "text": "The head of the U.S. oil industry’s top lobbying group said Tuesday that American producers are prepared to be a “stabilizing force” in Iran if the regime there falls - POLITICO",
      "date": "2026-01-13T22:45:09.000Z"
    },
    {
      "text": "Iranian officials say situation now is different than June 2025, as any US strike would be viewed as an existential threat to the regime. US officials say Iran only has 1/3 the number of missile launchers they had prior to the war in June - CNN",
      "date": "2026-01-13T22:37:38.000Z"
    },
    {
      "text": "Trump says Iran \"better behave\" after a reporter mentioned that Iran said it would retaliate if the U.S. strikes.",
      "date": "2026-01-13T22:19:33.000Z"
    },
    {
      "text": "HRANA says at least 18,137 people have been arrested in connection with the protests in Iran.",
      "date": "2026-01-13T22:10:42.000Z"
    },
    {
      "text": "HRANA (Human Rights Activists News Agency), a U.S.-based rights group, has raised its reported Iran protest-linked death toll from 2,003 to 2,403.",
      "date": "2026-01-13T22:09:52.000Z"
    },
    {
      "text": "State Department issues new travel alert ordering Americans to leave Iran now. Says “protests across Iran continue to escalate.”",
      "date": "2026-01-13T21:55:58.000Z"
    },
    {
      "text": "Israel is raising the alert in Israeli embassies and Jewish communities worldwide in preparation for anticipated attacks  - Mako",
      "date": "2026-01-13T21:43:42.000Z"
    },
    {
      "text": "CBS: “They’ve started killing protesters [in Iran].”\nTrump: “Yep.”",
      "date": "2026-01-13T21:06:18.000Z"
    },
    {
      "text": "Trump talking about Iran “The endgame is to win. I like winning. Define it as Venezuela, Soleimani, al-Baghdadi.” - CBS",
      "date": "2026-01-13T21:04:51.000Z"
    },
    {
      "text": "Trump says U.S. will take \"very strong action\" if Iran starts hanging protesters - CBS",
      "date": "2026-01-13T21:03:54.000Z"
    },
    {
      "text": "Trump on Iran: “We don’t like what’s happening there. We’ll see how it works out for them, it’s not going to work out well.” – CBS",
      "date": "2026-01-13T21:03:26.000Z"
    },
    {
      "text": "Jan 13 (Reuters) - Despite Iran's nationwide protests and years of external pressure, there are as yet no signs of fracture in the Islamic Republic's security elite that could bring an end to one of the world's most resilient governments.",
      "date": "2026-01-13T20:55:25.000Z"
    },
    {
      "text": "NEW: Saudi Arabia directed local media to limit both its coverage and support of the demonstrations to avoid Iranian retaliation - WSJ",
      "date": "2026-01-13T20:39:42.000Z"
    },
    {
      "text": "The UAE is taking a tougher line rather than trying to appease Iran, a stance that could make it a target for Iranian retaliation - WSJ",
      "date": "2026-01-13T20:43:28.000Z"
    },
    {
      "text": "Photo from iran showing a military vehicle equipped with a machine gun in Sadeghieh (Aryashahr), Tehran.\n\n2nd Sadeghieh Square\nCoordinates: 35.7225088, 51.3347752 (H/T @mostly_zakhim)\n\nDate unknown",
      "date": "2026-01-13T20:34:42.000Z"
    },
    {
      "text": "Two Middle Eastern diplomats say they expect Iran’s Islamic Republic to hold, citing no signs of fractures within the security elite - Reuters",
      "date": "2026-01-13T20:30:45.000Z"
    },
    {
      "text": "Netanyahu's security cabinet is now being briefed about the chance of regime collapse in Iran, Israel assesses Trump has decided to intervene, scope unclear - Reuters",
      "date": "2026-01-13T20:27:01.000Z"
    },
    {
      "text": "VP Vance is set to lead the Iran strategy meeting this afternoon with the national security team, a source familiar with the matter tells NewsNation and CBS",
      "date": "2026-01-13T19:55:33.000Z"
    },
    {
      "text": "Trump comments on Iran during his Detroit economic speech, mostly repeating what he already said on Truth Social.",
      "date": "2026-01-13T19:42:55.000Z"
    },
    {
      "text": "UPDATE: Iran strategy being talked about in multiple Trump admin discussions today, but the big meeting, the NSC principals committee meeting with @VP Vance as chair, is later today, sources told @CBSNews. It's scheduled for 4 pm, I'm told.",
      "date": "2026-01-13T19:23:06.000Z"
    },
    {
      "text": "Iran’s Defense Minister warns the country will respond to any U.S. aggression, according to Mehr News, an IRGC-affiliated Iranian state outlet.",
      "date": "2026-01-13T19:05:26.000Z"
    },
    {
      "text": "BREAKING: Iran International executive editor Mehdi Parpanchi says the figure of 12,000 Iranians killed in the protests is based on an IRGC Intelligence report submitted to Iran’s Presidential Office and Supreme National Security Council.",
      "date": "2026-01-13T19:00:11.000Z"
    },
    {
      "text": "Many EU countries support the designation of the IRGC as a terrorist organization, but Spain, Italy, Luxembourg and France are currently opposed - WSJ",
      "date": "2026-01-13T18:51:55.000Z"
    },
    {
      "text": "BREAKING: As Iranian officials asking China for security, economic assistance, Chinese media is calling Iranian requests \"pure fantasy,\" delaying the implementation an economic deal signed last year. China is concerned about opening up its banks and key companies to sanctions",
      "date": "2026-01-13T18:22:57.000Z"
    },
    {
      "text": "BREAKING: Some traders, officials in Iran have turned against the Iranian regime and IRGC. \n\n\"No one knows how much of the oil money that the [IRGC] get from selling Iran’s oil returns to the country ... they are too powerful to be questioned about it,” said a senior Iranian",
      "date": "2026-01-13T18:39:40.000Z"
    },
    {
      "text": "The Kurdish militant group PAK says they destroyed an IRGC headquarters in Kermanshah, and that the Iranian regime has \"deployed tens of thousands of Iranian armed forces and tens of thousands of Iraqi PMF forces\" to combat them",
      "date": "2026-01-13T18:10:29.000Z"
    },
    {
      "text": "NEW: White House envoy Steve Witkoff secretly met with exiled former crown prince of Iran Reza Pahlavi over the weekend - Axios",
      "date": "2026-01-13T18:06:13.000Z"
    },
    {
      "text": "BREAKING: A senior U.S. official says intelligence from Israel’s Mossad, shared with the Trump administration, estimates around 5,000 people have been killed in protests across Iran - Axios",
      "date": "2026-01-13T18:05:31.000Z"
    },
    {
      "text": "Trump: \"Good idea if Americans evacuate from Iran\"",
      "date": "2026-01-13T18:03:24.000Z"
    },
    {
      "text": "Iran-aligned journalists report Moscow in recent weeks supplied Iran with Russian-made Spartak armored vehicles and attack helicopters, presumably to help fend off protesters - POLITICO",
      "date": "2026-01-13T17:44:02.000Z"
    },
    {
      "text": "Several people in Tehran described a heavy security presence in central Tehran and burned-out government buildings. Witnesses said text messaging was still down, and internet users in Iran could connect to government-approved websites locally but nothing abroad. - AP",
      "date": "2026-01-13T17:10:22.000Z"
    },
    {
      "text": "BREAKING NEWS: At least 12,000, possibly up to 20,000 people have been killed in Iran - CBS",
      "date": "2026-01-13T16:43:39.000Z"
    },
    {
      "text": "More on the Russian stance regarding Iran, via Tass. They condemn international efforts to undermine the regime \"using methods of color revolutions\".",
      "date": "2026-01-13T16:35:54.000Z"
    },
    {
      "text": "Ukraine transmits in Persian: \"We stand with the people of Iran.\"",
      "date": "2026-01-13T16:23:23.000Z"
    },
    {
      "text": "Russia condemns U.S. involvement in Iranian internal affairs. - Iran Intl",
      "date": "2026-01-13T16:18:46.000Z"
    },
    {
      "text": "France, Germany, Spain, Italy, the Netherlands, the UK, Finland and Denmark have all announced this afternoon that they have summoned Iran’s respective ambassadors in their countries to their foreign ministries to formally object to the killings.",
      "date": "2026-01-13T16:12:03.000Z"
    },
    {
      "text": "BREAKING: Trump urges Iranians to “keep protesting” and “take over your institutions,” says all meetings with Iranian officials are canceled until killings stop, adding: “Help is on its way.”",
      "date": "2026-01-13T14:48:21.000Z"
    },
    {
      "text": "Iran’s Army Commander says preparations made over the six months since the 12-day war are fully aligned with current threats, adding Iran is stronger than before the war. He says the “Zionist regime’s” threat against Iran is real and is being taken seriously.",
      "date": "2026-01-13T14:24:48.000Z"
    },
    {
      "text": "NYT, quoting an unnamed Iranian health ministry official, claims at least 3,000 dead in Iran, with the number expected to grow.",
      "date": "2026-01-13T14:01:39.000Z"
    },
    {
      "text": "Casualty numbers from Iran's protests remain deeply uncertain, regime sources have told Reuters that around 2,000 people were killed, while opposition sources claim the toll could be as high as 12,000, but what is clear is that thousands have died across Iran over the past week",
      "date": "2026-01-13T10:45:59.000Z"
    },
    {
      "text": "NEW: An Iranian official tells Reuters about 2,000 people killed in protests in Iran, including security personnel, and blames “terrorists” for the deaths.",
      "date": "2026-01-13T10:41:03.000Z"
    },
    {
      "text": "Iran's Ministry of Intelligence announces they arrested \"Zionist terrorist cells\" in Zahedan that crossed the Pakistan-Iran border",
      "date": "2026-01-13T07:54:45.000Z"
    },
    {
      "text": "BREAKING: Iranian opposition outlet Iran International says an internal review of information from sources close to Iran's Supreme National Security Council, the presidency, the IRGC, medical staff and eyewitnesses indicates at least 12,000 people were killed during protests,",
      "date": "2026-01-13T07:32:40.000Z"
    },
    {
      "text": "BREAKING: German Chancellor Merz says the \"Iranian regime...is effectively finished. I assume we are now witnessing the last days and weeks of this regime.\"\n\nThis closely follows his Foreign Minister's declaration that the Islamic Republic of Iran is an illegitimate government.",
      "date": "2026-01-13T07:24:17.000Z"
    },
    {
      "text": "NEW: Iranian sources tell Faytuks Networks that protests are ongoing in Central Tehran, Zafaraniyeh, Punak.",
      "date": "2026-01-13T07:18:08.000Z"
    },
    {
      "text": "BREAKING: Germany's foreign minister says the Islamic Republic has \"lost all legitimacy,\" saying the Iranian government does not have support from its people.\n\n\"We will use all measures available to us against this regime, including sanctions\"",
      "date": "2026-01-13T06:50:27.000Z"
    },
    {
      "text": "We can confirm that members of the community who have relatives in Iran have recently received phone calls.",
      "date": "2026-01-13T06:05:31.000Z"
    },
    {
      "text": "NEW: Mobile phones in Iran are beginning to be able to make international calls after authorities cut internet access amid a protest crackdown, AP reports.",
      "date": "2026-01-13T05:37:25.000Z"
    },
    {
      "text": "Several people in Tehran were able to call The Associated Press. The AP bureau in Dubai, United Arab Emirates, was unable to call those numbers back, according to the report.",
      "date": "2026-01-13T05:47:21.000Z"
    },
    {
      "text": "Since January 1st, Faytuks Network has recorded a total of 120 events, including 18 mass killings, with hotspots in Tehran, Ilam, Kermanshah, Khorramabad, and Mashhad.\n\nView the full data here: https://google.com/maps/d/u/0/viewer?mid=14glSW4lcK__KKIgi9_HDVgtU7jAHeeU&ll=32.21326037292319%2C53.408153999999996&z=6…\n\n9 locations had protesters who were seen armed since January",
      "date": "2026-01-13T04:00:59.000Z"
    },
    {
      "text": "Credit to:\n\n@yoshii63 \n@bbcpersian \n@IranIntl \n@websterkaroon \n@TIME \n@HRANA_English \n@iranwire \n@gbrew24 \n\nFor their reporting, commentary, and assistance, as we try to piece together evidence of the protests in Iran, despite serious attempts from the Iranian government to",
      "date": "2026-01-13T04:31:58.000Z"
    },
    {
      "text": "Iranian authorities are hunting down Starlink users in an effort to stop protest videos from reaching the outside world - WSJ",
      "date": "2026-01-13T04:01:17.000Z"
    },
    {
      "text": "In Iran: 646 confirmed dead, including 505 protesters, 9 children, 133 military and law enforcement officers, one prosecutor, and seven non-protesting civilians, and another 579 deaths are under investigation. It should be emphasized these numbers are verified minimums, and the",
      "date": "2026-01-13T01:59:53.000Z"
    },
    {
      "text": "BREAKING: The Pentagon is presenting a wider range of strike options in Iran than previously reported, options include nuclear, ballistic missile targets - NYT",
      "date": "2026-01-13T01:28:07.000Z"
    },
    {
      "text": "Most likely options are cyberattacks, military strikes against Iranian domestic security apparatus that is suppressing protesters - NYT",
      "date": "2026-01-13T01:30:21.000Z"
    },
    {
      "text": "Trump is exploring options for diplomacy, but some US officials believe Iran is simply trying to delay a US attack rather than seriously engage in diplomacy - NYT",
      "date": "2026-01-13T01:33:15.000Z"
    },
    {
      "text": "BREAKING: Australia's Foreign Minister says the current Iranian government \"lacks legitimacy,\" Prime Minister Albanese says Australia will support a \"democratic Iran.\" \n\nAustralia is the second UN member state to claim the Islamic Republic is illegitimate, after Israel.",
      "date": "2026-01-13T01:25:47.000Z"
    },
    {
      "text": "Trump told NBC after being asked about a US response in Iran: \"It could happen.\"",
      "date": "2026-01-12T23:57:50.000Z"
    },
    {
      "text": "CBS reports a senior Iranian official reached out to the U.S. yesterday, saying they want to speak with U.S. envoy Steve Witkoff, and that Iran is willing to speak to him",
      "date": "2026-01-12T23:12:24.000Z"
    },
    {
      "text": "BREAKING: Trump briefed \"late on Monday\" for \"wide array of military options\" for Iran, as well as \"cyber and psychological options\" - CBS",
      "date": "2026-01-12T23:08:20.000Z"
    },
    {
      "text": "A senior Western official says Iranian authorities initially appeared reluctant to use lethal force, but changed course once the protests began threatening the regime - WaPo",
      "date": "2026-01-12T22:40:48.000Z"
    },
    {
      "text": "BREAKING: Trump announces 25% tariffs on \"any country doing business with the Islamic Republic of Iran\"",
      "date": "2026-01-12T21:49:05.000Z"
    },
    {
      "text": "Iran: Protests across Iran are escalating. Increased security measures, road closures, public transportation disruptions, and internet blockages are ongoing. Airlines continue to limit or cancel flights to and from Iran, with several suspending service until Friday, January 16.",
      "date": "2026-01-12T21:44:27.000Z"
    },
    {
      "text": "BREAKING: US State Department issues security alert for Iran, says \"protests across Iran are escalating\"",
      "date": "2026-01-12T21:46:56.000Z"
    },
    {
      "text": "NEW: New footage of protests in Tehran was sent to Indypersian, reportedly from tonight, according to the text on the video.",
      "date": "2026-01-12T21:30:12.000Z"
    },
    {
      "text": "An informal group of academics and professionals calculated that the number of protester deaths could have reached 6,000 in Tehran on Saturday, counting only \"reports from a handful of Tehran hospitals.\" - TIME",
      "date": "2026-01-12T20:54:51.000Z"
    },
    {
      "text": "Iran secretly releases the Greek-managed oil tanker St. Nikolas after seizing it in 2024 - TankerTrackers",
      "date": "2026-01-12T20:44:34.000Z"
    },
    {
      "text": "Senior Israeli officials believe Iran's request for negotiations with the US is a deception aimed to prevent a US attack on the country - Israel Channel 12",
      "date": "2026-01-12T20:41:21.000Z"
    },
    {
      "text": "The last Iranian state-affiliated media outlet that had stayed online, Tasnim, has now gone offline as Iran crosses the 100-hour-mark of nonstop internet blackout.",
      "date": "2026-01-12T20:35:46.000Z"
    },
    {
      "text": "Non-essential staff at France’s embassy in Iran have left the country, sources say - Bloomberg reports",
      "date": "2026-01-12T19:36:30.000Z"
    },
    {
      "text": "Some in the U.S. doubt that Iran is genuine about ending its nuclear program, telling Trump that Tehran may be finding a way to buy time and avoid American airstrikes and maintain its legitimacy despite widespread popular unrest - WSJ",
      "date": "2026-01-12T19:33:09.000Z"
    },
    {
      "text": "NEW: Top Iranian officials have threatened to attack U.S. troops if Washington strikes Iran. U.S. officials say it’s likely rhetoric for now, but still a credible concern - WSJ",
      "date": "2026-01-12T19:26:42.000Z"
    },
    {
      "text": "Some officials say Trump may strike first and then seek serious talks with Tehran afterward - WSJ",
      "date": "2026-01-12T19:26:24.000Z"
    },
    {
      "text": "NEW: Trump currently favors attacking Iran - WSJ",
      "date": "2026-01-12T19:25:49.000Z"
    },
    {
      "text": "Some senior administration aides, led by Vice President JD Vance, are urging Trump to try diplomacy before retaliating against Iran for killing protesters - WSJ",
      "date": "2026-01-12T19:25:27.000Z"
    },
    {
      "text": "Sweden’s Foreign Ministry is urging all Swedish citizens to leave Iran, advising against all travel and telling Swedes currently in the country to leave",
      "date": "2026-01-12T19:20:08.000Z"
    },
    {
      "text": "BREAKING: A state of emergency has been declared in several Iranian cities, several sources in Iran tell Norwegian outlet Aftenposten",
      "date": "2026-01-12T19:13:54.000Z"
    },
    {
      "text": "Mashhad, Iran: BBC Persian cites a source claiming 180–200 bodies were brought to a morgue before dawn Friday and buried quickly. \n\nWe cannot independently verify the figure.",
      "date": "2026-01-12T18:56:07.000Z"
    },
    {
      "text": "U.S. Ambassador to Israel Mike Huckabee tells Sky News the U.S. has no plans to intervene in Iran, saying “neither the U.S. nor Israel is making plans to engage.”",
      "date": "2026-01-12T18:47:40.000Z"
    },
    {
      "text": "Iran’s public messaging differs from what it is privately conveying to Washington - White House says",
      "date": "2026-01-12T18:17:39.000Z"
    },
    {
      "text": "A U.S. official told Al Jazeera that American forces in the Middle East are ready for any contingency and any mission, and to defend themselves and U.S. interests. The official added that planning for military options against Iran has reached advanced stages.",
      "date": "2026-01-12T16:26:43.000Z"
    },
    {
      "text": "BREAKING: The President of the European Parliament says Iranian diplomats, officials, and regime representatives are banned with immediate effect from all Parliament premises in Brussels, Strasbourg, and Luxembourg due to Tehran’s violent crackdown on protests.",
      "date": "2026-01-12T15:13:59.000Z"
    },
    {
      "text": "NEW: The Iranian Foreign Minister has approached Steve Witkoff seeking discussions on the ongoing protests in Iran, sources say. The two sides also discussed a possible meeting between them in the coming days. - Axios",
      "date": "2026-01-12T15:06:41.000Z"
    },
    {
      "text": "Iran’s parliamentary National Security Commission says it has evidence of U.S. and Israeli involvement in recent unrest, claiming both overt and covert documents exist. The commission said most deaths were caused by foreign-backed actors and warned of a “decisive” response. -",
      "date": "2026-01-12T11:20:26.000Z"
    },
    {
      "text": "Iranian state TV says \"a million\" people have come out in the streets today to rally in support of the Islamic Republic",
      "date": "2026-01-12T10:53:32.000Z"
    },
    {
      "text": "The authenticity of some of these clips and streams is called into question, as the \"live\" streams were edited and often experienced abrupt cuts. On a few occasions, the streams would cut to interviews- some of which, in the night (it is currently 2:25 PM in Iran.)",
      "date": "2026-01-12T10:55:21.000Z"
    },
    {
      "text": "\"Tens of thousands\" protested in Tehran, per AP. Less than the \"one million\" proclaimed by state media, more similar to the original established goal of 100,000, albeit seemingly lower.",
      "date": "2026-01-12T11:07:54.000Z"
    },
    {
      "text": "BREAKING: Iranian Foreign Minister Araghchi says internet will be restored soon nationwide",
      "date": "2026-01-12T10:28:30.000Z"
    },
    {
      "text": "Iran's nationwide internet shutdown imposed on 8 January has now lasted more than 84 hours, monitor NetBlocks says.",
      "date": "2026-01-12T07:34:58.000Z"
    },
    {
      "text": "Iranian state TV reports that there are pro-government demonstrations ongoing in Hamadan, Ilam, Kerman, and Rasht.",
      "date": "2026-01-12T06:59:29.000Z"
    },
    {
      "text": "BREAKING: President to meet with senior administration officials on Tuesday to discuss the US response to protests in Iran, options include deploying \"secretive cyber weapons against Iranian military and civilian sites\"",
      "date": "2026-01-12T04:44:00.000Z"
    },
    {
      "text": "Other options include boosting antigovernment sources online, sanctions on the Iranian regime, and military strikes. Secretary of State Marco Rubio, Defense Secretary Pete Hegseth and Joint Chiefs Chair Gen. Dan Caine are expected to attend the Tuesday meeting - WSJ",
      "date": "2026-01-12T04:45:14.000Z"
    },
    {
      "text": "NEW: Iran's neighbors fear that Iran could plunge into a Syria-style civil war, with separatist uprisings in provinces populated by Kurds, Baluchis and other minorities spilling across borders - WSJ",
      "date": "2026-01-12T04:31:37.000Z"
    },
    {
      "text": "Diplomats say Trump may be tempted to remove Khamenei through a Venezuelan decapitation \"template\" and hope for better luck with a \"more pliable successor\" - WSJ",
      "date": "2026-01-12T04:33:15.000Z"
    },
    {
      "text": "Iranian state TV estimates the pro-government demonstration in Enghelab Square at 2 PM local time on Monday will have 100,000 attendees.",
      "date": "2026-01-12T03:30:44.000Z"
    },
    {
      "text": "EU foreign policy chief Kaja Kallas says the EU will propose new sanctions on Iran. The German news agency dpa says the sanctions will likely focus on individuals responsible for violence against protesters - DW",
      "date": "2026-01-12T03:14:14.000Z"
    },
    {
      "text": "Trump spoke with reporters aboard Air Force One for 21 minutes. Among other topics, Iran was discussed.",
      "date": "2026-01-12T02:34:48.000Z"
    },
    {
      "text": "Initial meetings have taken place in the Trump admin to discuss ways to support Iranian protests. Many in the admin believe major kinetic action would undermine the protests- US officials said most of the options to be presented to the president are \"not kinetic.\" Options include",
      "date": "2026-01-12T02:09:39.000Z"
    },
    {
      "text": "BREAKING: Trump says yesterday Iran approached the US for a nuclear agreement, Trump says \"maybe we'll meet with them\"",
      "date": "2026-01-12T01:49:57.000Z"
    },
    {
      "text": "Gop. Sen Lindsay Graham at a fundraising event with the Tzedek Association: \"The reason I had to cut the speech off a little bit... I don't know what, but this might be the night [US attacks on Iran]. It's just a matter of time now\"\n\nhttps://vimeo.com/1153389802?share=copy…",
      "date": "2026-01-12T01:19:45.000Z"
    },
    {
      "text": "TRUMP: Iran seems to have crossed my red line...some of [the protesters] were shot...I am getting an hourly report, and we are going to make a determination...We'll consider targets that they wouldn't even believe",
      "date": "2026-01-12T00:32:19.000Z"
    },
    {
      "text": "TRUMP: We're talking about [sending Starlink to Iran]...I'm gonna call [Elon] as soon as I'm finished [talking to the press]",
      "date": "2026-01-12T00:31:24.000Z"
    },
    {
      "text": "Trump on board Air Force 1: \"Iran is starting to cross it [my red line]. There seems to be some people killed that aren't supposed to be killed. We are looking at it very seriously, the military is looking at it and we're looking at some very strong options.\"",
      "date": "2026-01-12T00:27:43.000Z"
    },
    {
      "text": "WATCH: Multiple people hit by a U-Haul truck during an Iranian protest in Los Angeles.",
      "date": "2026-01-11T23:50:16.000Z"
    },
    {
      "text": "Trump on Iran: “Some protesters were killed through stampedes, some were shot.”",
      "date": "2026-01-12T00:22:11.000Z"
    },
    {
      "text": "New footage from the Kahrizak Forensic Medical Center in Tehran shows at least 100 dead bodies.\n\nThe footage was shared through Starlink and was reportedly taken on Saturday\n\nhttps://t.me/VahidOnline/69796…",
      "date": "2026-01-12T00:13:52.000Z"
    },
    {
      "text": "IRGC-affiliated media outlet Tasnim says over 100 members of Iran's security forces have been killed",
      "date": "2026-01-11T23:30:50.000Z"
    },
    {
      "text": "Regime-organized funeral ceremonies reportedly backfired today as relatives and mourners began chanting “Death to Khamenei.” - IranWire reports",
      "date": "2026-01-11T23:29:53.000Z"
    },
    {
      "text": "A senior Israeli official says that Israel's new assessment is that the combination of protester's outrage and the lack of economic prospects will \"not allow the Iranian regime to survive in the long term\" - \"the story of the Iranian regime is over\" - Israeli Channel 12",
      "date": "2026-01-11T21:46:06.000Z"
    },
    {
      "text": "Shocked by reports of violence by Iranian authorities, urge Iranian authorities to exercise restraint and restore communications - UN Secretary-General Guterres",
      "date": "2026-01-11T21:25:45.000Z"
    },
    {
      "text": "New \"news leaks\" about Trump's meetings and preparedness regarding Iran are not 100% accurate \"because no one knows when or how it will happen,\" and a senior Israeli official says \"the only thing that matters is how [Khamenei] will die\" - Iran International",
      "date": "2026-01-11T21:20:40.000Z"
    },
    {
      "text": "Iran's Prosecutor General Mohammad Movahedi-Azad warns Iranian officials who are \"playing into the enemy's hands\" to be \"mindful of the messages and consequences of their words and behavior.\" - FARAJA statement",
      "date": "2026-01-11T21:01:13.000Z"
    },
    {
      "text": "U.S. officials say Trump isn’t expected to send American forces into Iran, and no major troop or asset movements are currently planned - Politico",
      "date": "2026-01-11T20:36:40.000Z"
    },
    {
      "text": "The British ambassador in Tehran has been summoned following a protester removing the Iranian flag from the embassy in London - BBC",
      "date": "2026-01-11T19:15:57.000Z"
    },
    {
      "text": "Iran sends urgent letter to the UN Security Council warning that no state may invoke human rights or “supporting the people” to incite violence, destabilize societies, or engineer unrest, calling such claims a distortion of international law - Iranian UN mission statement.",
      "date": "2026-01-11T18:29:35.000Z"
    },
    {
      "text": "IRGC statement: Iran’s Revolutionary Guards accused Trump and Netanyahu of supporting and directing “hired armed terrorists” to carry out unrest, attacks on holy sites, and destruction of property in Iran. The IRGC said Washington and its allies were evading responsibility and",
      "date": "2026-01-11T18:06:33.000Z"
    },
    {
      "text": "WARNING - GRAPHIC FOOTAGE:\nVideos from Kahrizak Forensic Medical Center south of Tehran show dozens of bodies, as families wail and desperately try to identify relatives killed during widespread protests",
      "date": "2026-01-11T17:11:17.000Z"
    },
    {
      "text": "AP reports more than 538 people killed in protests across Iran, including 490 protesters and 48 security personnel, with over 10,600 arrests reported.",
      "date": "2026-01-11T16:50:38.000Z"
    },
    {
      "text": "Trump is set to be briefed Tuesday on options for responding to Iran’s protests, U.S. officials say, signaling he’s considering action against the regime - WSJ",
      "date": "2026-01-11T16:11:42.000Z"
    },
    {
      "text": "In several small Iranian cities that had slipped beyond regime control, IRGC forces launched assaults using heavy machine guns, automatic weapons, and military-grade arms - Iran International",
      "date": "2026-01-11T16:10:39.000Z"
    },
    {
      "text": "US President Donald Trump is weighing a series of potential military options in Iran following deadly protests in the country, two US officials have told CNN",
      "date": "2026-01-11T15:49:27.000Z"
    },
    {
      "text": "BREAKING: HRANA, a U.S.-based rights group, says Iran’s protest-linked death toll has risen to 466",
      "date": "2026-01-11T15:27:47.000Z"
    },
    {
      "text": "BREAKING: Faytuks Network has visually confirmed 207 protest-related deaths in Iran since the unrest began.\n\nThis figure includes deaths on both sides. The true toll is likely higher.",
      "date": "2026-01-11T15:22:31.000Z"
    },
    {
      "text": "Iran has asked Iraqi militias, including Kata’ib Hezbollah, for assistance in quelling protests, officials say - FOXNews",
      "date": "2026-01-11T14:25:05.000Z"
    },
    {
      "text": "Trump has been warned that the US military needs more time to prepare for strikes against Iran - The Telegraph",
      "date": "2026-01-11T13:29:35.000Z"
    },
    {
      "text": "President Trump is considering a range of options to aid escalating protests and weaken the Iranian regime, with senior U.S. officials indicating that while military strikes remain on the table, the administration is currently prioritizing \"non-kinetic\" measures such as",
      "date": "2026-01-11T11:26:27.000Z"
    },
    {
      "text": "BREAKING: US Secretary of State Marco Rubio and Israeli Prime Minister Netanyahu discussed the possibility of US intervention in Iran in a phone call yesterday. Israel is on high alert for the possibility of US intervention in Iran - Reuters",
      "date": "2026-01-11T06:01:01.000Z"
    },
    {
      "text": "A video from Iran International shows a huge protest in Ahvaz, Khuzestan, on Saturday night.",
      "date": "2026-01-11T05:50:00.000Z"
    },
    {
      "text": "Geoconfirmed. Body collection of killed protestors from an auxiliary overflow warehouse at 35.51825, 51.37005 in the Forensic Diagnostic and Laboratory Center of Tehran Compound in Kahrizak, Iran. @FaytuksNetwork @GeoConfirmed  Evidence below.",
      "date": "2026-01-11T01:34:21.000Z"
    },
    {
      "text": "Iranian state TV claims there has been at least 30 trillion rials of damage in Tehran municipality (around $20.7 million)",
      "date": "2026-01-11T05:13:18.000Z"
    },
    {
      "text": "Increasing indications that the US intends to attack Iran,  possibly as early as next week - Amwaj media",
      "date": "2026-01-11T03:23:13.000Z"
    },
    {
      "text": "Suspected collection point for victims of Tehran protests has been geolocated by @Mitch_Ulrich.\nVideos and images from the site show dozens of filled body bags, lending credibility to claims of mass killings of protesters across Iran.",
      "date": "2026-01-11T01:51:07.000Z"
    },
    {
      "text": "BREAKING: Trump has been briefed on new options for military strikes in Iran and is seriously considering it in response to the Iranian regime’s efforts to suppress demonstrations, US officials tell The New York Times. \n\nhttps://nytimes.com/2026/01/10/us/politics/trump-iran-strikes.html…",
      "date": "2026-01-11T00:43:07.000Z"
    },
    {
      "text": "BREAKING: President Trump has been briefed in recent days on new options for military strikes in Iran as he considers following through on his threat to attack the country for cracking down on protesters, according to multiple U.S. officials familiar with the matter. - NYT",
      "date": "2026-01-11T00:38:07.000Z"
    },
    {
      "text": "BREAKING: The most conservative estimates indicate that at least 2,000 people have been killed over the past 48 hours as Iran's security forces are now using lethal force against protesters nationwide. - Iran International",
      "date": "2026-01-10T22:58:59.000Z"
    },
    {
      "text": "Scoop: Iran's security forces are using lethal force against protesters nationwide, informed sources told Iran International, with preliminary estimates pointing to mass casualties as a sweeping crackdown unfolds amid a near-total internet shutdown.\n\nFootage sent to Iran",
      "date": "2026-01-10T23:14:57.000Z"
    },
    {
      "text": "On Thursday, January 8th, at least 110 protesters were killed in Tehran and Rasht alone, according to the BBC.",
      "date": "2026-01-10T23:14:03.000Z"
    },
    {
      "text": "According to information obtained by the BBC from reliable sources, on Thursday 18 Dey, 110 protesters were killed in just two cities, Tehran and Rasht.\n\n70 killed in Rasht\nKilled in Tehran\n\n#IranProtests x.com/fseifikaran/st…",
      "date": "2026-01-10T23:14:24.000Z"
    },
    {
      "text": "Lufthansa, flydubai, Turkish Airlines, AJet, Pegasus, Qatar Airways and Austrian Airlines have suspended flights to Iran - FOX",
      "date": "2026-01-10T22:41:00.000Z"
    },
    {
      "text": "Tasnim, an IRGC-affiliated outlet, accuses Iranian protesters of having ties to \"takfiri terrorists in Syria,\" likely referring to the HTS and Syrian President al-Sharaa. Tasnim claims there is a \"single command center\" between the groups and they plan to \"implement the Syrian",
      "date": "2026-01-10T22:14:33.000Z"
    },
    {
      "text": "NEW: U.S. Senator Lindsey Graham tells Iranians their “long nightmare is soon coming to a close,” praising their bravery and saying it has been noticed by President Donald Trump and that “help is on the way.”",
      "date": "2026-01-10T20:05:30.000Z"
    },
    {
      "text": "BREAKING: Trump says he's ready to help Iranians",
      "date": "2026-01-10T18:29:37.000Z"
    },
    {
      "text": "BREAKING: Trump administrations have had preliminary discussions on how to carry out an attack on Iran to follow through on Trump's threats, one option being discussed is a large-scale aerial strike on multiple Iranian military targets - WSJ",
      "date": "2026-01-10T18:14:25.000Z"
    },
    {
      "text": "First reported footage shared through starlink tonight of protests in Tehran\n\nhttps://t.me/iliaen/2521",
      "date": "2026-01-10T16:07:38.000Z"
    },
    {
      "text": "Reuters: A doctor in northwestern Iran says large numbers of injured protesters have been brought to hospitals since Friday, including head injuries, broken limbs and deep cuts. The doctor said at least 20 patients at one hospital were shot with live ammunition and 5 later died.",
      "date": "2026-01-10T16:06:24.000Z"
    },
    {
      "text": "The crimes of the Islamic Republic against protesters\n\nThis Telegram channel documents crimes by Iranian authorities against protesters for use by international courts and media.\n\nWarning: The channel contains graphic content. Viewer discretion is advised.",
      "date": "2026-01-10T15:32:27.000Z"
    },
    {
      "text": "A protester in Tehran told the Guardian that many people have been shot in the city: \"Snipers have been stationed... We saw hundreds of bodies\"",
      "date": "2026-01-10T14:48:47.000Z"
    },
    {
      "text": "Grim reading from the BBC:\n\nMultiple hospitals in Iran are overwhelmed with patients with many having gunshot wounds to the head and eyes, according to Iranian medics.",
      "date": "2026-01-10T13:49:33.000Z"
    },
    {
      "text": "NEW: Iran’s attorney general says protesters and those who support them will be considered “enemies of God,” an offense punishable by death, AP reports\n\nhttps://apnews.com/article/iran-protests-us-israel-war-nuclear-economy-c867cd53c99585cc5e0cd98eafe95d16…",
      "date": "2026-01-10T13:42:31.000Z"
    },
    {
      "text": "Iranian news agency Tasnim reported that a large public rally against recent protests will be held in Tehran on Monday at 2 p.m. local time in Enghelab Square.",
      "date": "2026-01-10T13:34:02.000Z"
    },
    {
      "text": "BREAKING: Faytuks Network has visually confirmed 113 protest-related deaths in Iran since the unrest began.\n\nThis figure includes deaths on both sides. The true toll is likely higher.",
      "date": "2026-01-10T13:07:09.000Z"
    },
    {
      "text": "A local source affiliated with PJAK/PAK say at least 39 IRGC personnel were killed in the past 24 hours in clashes involving PJAK/PAK-linked forces.",
      "date": "2026-01-10T13:03:31.000Z"
    },
    {
      "text": "A loudspeaker announcement in Neyshabur, Iran: \"To support the cause of the Islamic Revolution, we ask the shopkeepers and business owners to reopen the bazaar at the earliest possible opportunity. By doing so, they will turn the hopes of the revolution's enemies into despair.",
      "date": "2026-01-10T10:25:26.000Z"
    },
    {
      "text": "An Iranian doctor speaking to the BBC via Starlink satellite internet says Farabi Hospital, Tehran’s main eye specialist centre, has entered crisis mode, with emergency services overwhelmed. Non-urgent admissions and surgeries have been suspended, and additional staff called in.",
      "date": "2026-01-10T09:23:27.000Z"
    },
    {
      "text": "An Iranian government plane is out of Tehran, heading South.",
      "date": "2026-01-10T07:09:05.000Z"
    },
    {
      "text": "NEW: Iranian state-affiliated media outlet Fars says 8 IRGC members were killed in Kermanshah in fighting with \"separatist organizations\"",
      "date": "2026-01-10T07:11:36.000Z"
    },
    {
      "text": "An IranWire analysis on an Iranian subsidy card shows the prices of basic goods have increased more than initial government announcements indicated.\n\nPrince increases are as follows:\nCooking oil: 133%\nEggs: 125%\nChicken: 70%\nRice: 30%\nRed meat: 16%\n\nIranWire cautions the real",
      "date": "2026-01-10T06:40:40.000Z"
    },
    {
      "text": "The United States supports the brave people of Iran",
      "date": "2026-01-10T05:30:55.000Z"
    },
    {
      "text": "NEW: Reza Pahlavi, the son of Iran's last Shah Mohammad Reza Pahlavi, calls for protests in Iran today and tomorrow (Saturday, Sunday) at 6 PM local time, with the goal to \"prepare for the seizure of city centers\" rather than \"going out into the streets\"",
      "date": "2026-01-10T05:12:35.000Z"
    },
    {
      "text": "Reza Pahlavi also announced he is \"preparing to return to the homeland,\" calls on the Iranian armed forces to \"slow down\" and wait for the \"appointed day\" to \"disable the repression machine.\"",
      "date": "2026-01-10T05:14:04.000Z"
    },
    {
      "text": "IRINN (Iran’s state TV news): The military says protesters’ goal is the “disintegration” of Iran.",
      "date": "2026-01-10T04:00:29.000Z"
    },
    {
      "text": "Iran's state news outlet IRINN says the atmosphere in Iran is turning into a \"Syria-like scenario\"",
      "date": "2026-01-10T03:54:24.000Z"
    },
    {
      "text": "BREAKING: Three Iranian government officials told the WSJ unprompted that they privately longed for the return of the Pahlavi dynasty, one of them saying \"he wanted his king back.\"",
      "date": "2026-01-10T03:17:42.000Z"
    },
    {
      "text": "A video from Iran International shows intense scenes tonight at the central square of Saadat Abad, Tehran. \n\nCoordinates: around 35.781684, 51.374576",
      "date": "2026-01-10T01:40:08.000Z"
    },
    {
      "text": "Mashhad, Iran: Video shows buses used to transport Iranian security forces, burned down.",
      "date": "2026-01-10T01:19:09.000Z"
    },
    {
      "text": "Basij forces, while fleeing, began opening fire to escape. \"Several people were killed tonight\" in these shootings, while all main streets in Tehran continue to be occupied by protesters - Iranian journalist Omid Habibinia",
      "date": "2026-01-10T00:37:03.000Z"
    },
    {
      "text": "IRGC-affiliated media outlet Tasnim claims that there was \"peace in all Iranian cities on January 9th, no news of unrest\"",
      "date": "2026-01-10T00:25:12.000Z"
    },
    {
      "text": "Member of Iran’s Government Information Council to IRGC-affiliated Tasnim: The riots were the “second stage” of the war against Iran led by Israel and Trump",
      "date": "2026-01-10T00:24:59.000Z"
    },
    {
      "text": "BREAKING: Six hospitals in Tehran record at least 217 protester deaths - TIME",
      "date": "2026-01-09T23:56:40.000Z"
    },
    {
      "text": "Join our Discord server to follow the news from Iran as nationwide protests continue amidst a total internet blackout.",
      "date": "2026-01-08T19:06:57.000Z"
    },
    {
      "text": "Jamming of Starlink terminals began many hours before the internet blackout in Iran, with 30% of uplink and downlink traffic being disrupted in the early hours, rising to 80% by 10 PM local time. This kind of interference has \"never been seen...the technology involved was likely",
      "date": "2026-01-09T22:36:40.000Z"
    },
    {
      "text": "There is persistent gunfire in Fardis near Tehran, according to footage shared this evening. \n\n\"I'm filming. I'm filming so it can be seen, look at what’s happening... Look at the bullets... look at how many there are\", the person filming says",
      "date": "2026-01-09T21:52:01.000Z"
    },
    {
      "text": "BREAKING: Iran's Supreme National Security Council says Iran is \"in the middle of a war...there is no peace and no ceasefire...the rioters are a quasi-terrorist group...moving towards the military and law enforcement centers to obtain weapons...trying to start a civil war.\"",
      "date": "2026-01-09T21:44:45.000Z"
    },
    {
      "text": "X has changed the Iranian flag",
      "date": "2026-01-09T21:12:03.000Z"
    },
    {
      "text": "Trump tells Iranian leaders: \"You better not start shooting [protestors], because we're gonna shoot too.\"",
      "date": "2026-01-09T21:05:40.000Z"
    },
    {
      "text": "The Center for Human Rights in Iran (CHRI) has received \"credible first-hand reports of hospitals packed with injured protesters in areas of Tehran, Mashhad, and Karaj\"  \n\nCHRI adds that these are the only areas from which information has been received.\n\nhttps://iranhumanrights.org/2026/01/grave-concern-that-state-massacre-of-protesters-is-underway-in-iran-amid-internet-blackout/…",
      "date": "2026-01-09T20:57:11.000Z"
    },
    {
      "text": "BREAKING: Trump says Iran in \"big trouble,\" says the people are \"taking over certain cities\"",
      "date": "2026-01-09T20:53:32.000Z"
    },
    {
      "text": "Trump says the US will get involved when Iran starts killing people, \"not necessarily boots on the ground\"",
      "date": "2026-01-09T20:56:35.000Z"
    },
    {
      "text": "The plane of Iranian Foreign Minister Araghchi is leaving Beirut earlier than scheduled. He was supposed to conduct talks on Saturday, however he is leaving Lebanon late Friday night. Reasons unclear.",
      "date": "2026-01-09T20:47:29.000Z"
    },
    {
      "text": "Karaj, Iran: Locals say the municipality building on Hadadi Street was set on fire.",
      "date": "2026-01-09T20:42:22.000Z"
    },
    {
      "text": "Tehran (Tehran Pine Square), Iran: Locals claim thousands are in the streets",
      "date": "2026-01-09T20:32:30.000Z"
    },
    {
      "text": "Shahsavar, Iran: Locals say a regime-affiliated individual was beaten.",
      "date": "2026-01-09T20:28:15.000Z"
    },
    {
      "text": "Tehran: Locals say unrest is spreading from Dolati Street toward Pasdaran.",
      "date": "2026-01-09T20:25:16.000Z"
    },
    {
      "text": "Shiraz, Iran: New Footage is trickling out as some locals briefly regain connectivity via Starlink.",
      "date": "2026-01-09T20:05:52.000Z"
    },
    {
      "text": "Tehran, Iran: Protests are reported in at least 10 locations across the capital, locals say",
      "date": "2026-01-09T20:01:34.000Z"
    },
    {
      "text": "Mashhad, Iran: Videos trickling out show a large crowd. Locals say it’s several times bigger than last night.",
      "date": "2026-01-09T19:59:37.000Z"
    },
    {
      "text": "BREAKING: Faytuks Network has visually confirmed 79 protest-related deaths in Iran since the unrest began.\n\nThe true toll is likely higher.",
      "date": "2026-01-09T19:32:31.000Z"
    },
    {
      "text": "Two messages from two people who were present at last night's gatherings:\n\n\"Tehran last night had at least 200 killed, at least\"\n\n\"Last night in Karaj, a large number were killed. A friend's brother who went to collect his wife's body says he was able to identify from among about",
      "date": "2026-01-09T19:27:13.000Z"
    },
    {
      "text": "BREAKING: A senior Iranian official tells The Telegraph that Supreme Leader Khamenei has ordered the IRGC to remain at the highest level of readiness, even higher than during the June war, placing his fate in the hands of the force amid fears of defections elsewhere. The official",
      "date": "2026-01-09T19:22:34.000Z"
    },
    {
      "text": "BBC reports Iranians inside the country are receiving threatening text messages from the IRGC and police warning them not to attend protests. An eyewitness at a hospital in southern Iran says some people were shot in the head, with many injured protesters admitted for treatment.",
      "date": "2026-01-09T19:18:40.000Z"
    },
    {
      "text": "BREAKING: Israeli Channel 12 reports a significant shift in the IDF’s assessment, warning there is now a real risk to the survival of Iran’s ayatollah regime.",
      "date": "2026-01-09T17:58:39.000Z"
    },
    {
      "text": "BREAKING: Mehr News, an Iranian state outlet affiliated with the IRGC, says Col. Norouz Shariati, police commander of Holilan County in Ilam Province, has been killed",
      "date": "2026-01-09T17:43:19.000Z"
    },
    {
      "text": "Bloomberg reports China eyeing Canadian, not Iranian, oil to replace Venezuelan imports",
      "date": "2026-01-09T17:43:02.000Z"
    },
    {
      "text": "Iran International reports today marks day 13 of protests in Iran, saying the unrest is “gradually turning into a full-fledged revolution.”",
      "date": "2026-01-09T17:41:00.000Z"
    },
    {
      "text": "BREAKING: The Iranian outlet Manoto reports that Bank Melli (Iran's largest bank) suffered a bank run, causing the bank to suspend cash withdrawals.",
      "date": "2026-01-09T16:27:39.000Z"
    },
    {
      "text": "Footage from this evening in Shiraz, Iran. The video was shared with The Independent Persian via Starlink.\n\nProtests continuing across Iran tonight, based on limited information still coming through.",
      "date": "2026-01-09T17:17:29.000Z"
    },
    {
      "text": "BREAKING: AFP reports that more than 50 people have been killed in Iran’s protests.",
      "date": "2026-01-09T17:06:30.000Z"
    },
    {
      "text": "Faytuks Network: Map showing areas affected by protests in Iran",
      "date": "2026-01-09T15:49:14.000Z"
    },
    {
      "text": "Early this week, U.S. intelligence assessed that the protests lacked sufficient energy to challenge the regime, U.S. officials told Axios\n\nBut that view is being reassessed in light of recent events. \n\n\"The protests are serious\", a senior official says.\n\nhttps://axios.com/2026/01/09/iran-protests-trump-us-intelligence…",
      "date": "2026-01-09T14:54:26.000Z"
    },
    {
      "text": "NEW: Iranian state media publish footage they claim shows armed protesters firing at security guards in Kermanshah.",
      "date": "2026-01-09T14:01:05.000Z"
    },
    {
      "text": "NEW: IRGC Intelligence Organization says the current situation is “unacceptable,” warning that responsibility for the blood of victims of recent “terrorist incidents” lies with those who planned them, and pledging to ensure security alongside the Iranian people. - Tasnim",
      "date": "2026-01-09T13:58:57.000Z"
    },
    {
      "text": "Iran' Ministry of Intelligence asking people to help identify protesters",
      "date": "2026-01-09T13:36:03.000Z"
    },
    {
      "text": "Iran’s foreign minister warns that if the U.S. and Israel attack again, “they will suffer another defeat.”",
      "date": "2026-01-09T12:53:20.000Z"
    },
    {
      "text": "Iran FM Abbas Araghchi: “The U.S. and Israel are behind the current unrest in Iran.”",
      "date": "2026-01-09T12:52:13.000Z"
    },
    {
      "text": "Tasnim News Agency, an IRGC-affiliated Iranian outlet, is reporting multiple police deaths in Tehran and several security force deaths in Hamedan.",
      "date": "2026-01-09T12:40:29.000Z"
    },
    {
      "text": "Iran judiciary chief vows there will be ‘decisive’ punishment for protesters - AP",
      "date": "2026-01-09T12:21:05.000Z"
    },
    {
      "text": "Iranian state media say six members of the security forces were killed during overnight unrest in the city of Hamedan — Tasnim News",
      "date": "2026-01-09T12:06:32.000Z"
    },
    {
      "text": "Opposition journalist Ilia Hashemi is reporting the following:\n\n\"Based on conversations with eyewitnesses and a hospital surgeon in Tehran, I can confirm that the number of people killed last night in Tehran, Karaj, and Shahriar is significant.\n\nThe surgeon said, “I was in the",
      "date": "2026-01-09T11:51:16.000Z"
    },
    {
      "text": "Opposition-linked sources claim a large number of protesters were killed overnight in Tehran, Karaj, and Shahriar after security forces used live ammunition. Eyewitnesses and a Tehran hospital surgeon claim casualties were heavy, exceeding those during the recent 12-day war.",
      "date": "2026-01-09T11:49:43.000Z"
    },
    {
      "text": "Trump: I don't know what [Jimmy Carter] would have done...but there are those that say [the Iran hostage crisis] ended his presidential election...I hope that doesnt happen to me...but we have Razin Caine and all of these people",
      "date": "2026-01-09T11:05:22.000Z"
    },
    {
      "text": "Trump: Obama should have [bombed Iran]...I don't know how Jewish people voted for Obama",
      "date": "2026-01-09T11:05:32.000Z"
    },
    {
      "text": "In a televised speech Supreme Leader Khamenei urged Iranians to preserve unity, saying “some rioters” are seeking to please the U.S. president by damaging public property. He told Trump to focus on problems at home and said Iran will not tolerate “mercenaries for foreigners.”",
      "date": "2026-01-09T09:34:29.000Z"
    },
    {
      "text": "BREAKING: Faytuks Network has visually confirmed 68 protest-related deaths in Iran since the unrest began.\n\nThe true toll is likely higher.",
      "date": "2026-01-09T09:19:06.000Z"
    },
    {
      "text": "Turkish Airlines is cancelling all of their flights from Istanbul to Tehran on Friday. - AFP",
      "date": "2026-01-09T07:34:47.000Z"
    },
    {
      "text": "BREAKING: Trump says Iran is on \"the verge of collapse,\" says \"[Khamenei] is looking to go some place\" to escape",
      "date": "2026-01-09T02:54:07.000Z"
    },
    {
      "text": "Trump says he put Iran \"on notice\" that they will be hit \"very hard\" if they kill civilians, and makes a pledge to come to the Iranian people's aid.",
      "date": "2026-01-09T02:55:06.000Z"
    },
    {
      "text": "Photo of Gorgan, Iran, from around three hours ago. - mamlekate",
      "date": "2026-01-08T21:50:36.000Z"
    },
    {
      "text": "As of the end of day 12 (8.1.26/18.10.04) 153 cities and towns have seen protests :\n\nShiraz, Isfahan, Malard, Karaj, Zahedan, Kermanshah, Tehran, Mashhad, Shush, Hamadan, Dargahan, Najafabad, Yazd, Gorgan, Kerman, Arak, Nurabad, Foladshahr, Urmia, Izeh, Malayer, Shahrekord,",
      "date": "2026-01-08T22:12:51.000Z"
    },
    {
      "text": "Iran International reports the IRIB (Iran’s state broadcaster) headquarters in Isfahan was set on fire.",
      "date": "2026-01-08T22:11:38.000Z"
    },
    {
      "text": "Events in Iran have escalated rapidly in recent hours, but with internet down it’s difficult to get information out. One source in Tehran tells us: “Shooting, a lot of shooting.”",
      "date": "2026-01-08T21:54:52.000Z"
    },
    {
      "text": "Iranian security forces withdrew from central Tabriz - Manoto",
      "date": "2026-01-08T21:49:02.000Z"
    },
    {
      "text": "A plane flying from Istanbul to Mashhad is returning to Istanbul (#PC520)\n\nA plane from Istanbul to Tehran has landed at Istanbul airport (#TK872)\n\nA plane flying from Istanbul to Shiraz is returning to Istanbul (#TK884)",
      "date": "2026-01-08T21:47:03.000Z"
    },
    {
      "text": "Iranian State TV is playing old clips of Tucker Carlson, no comments or reports on the ongoing protests or nationwide internet and telephone blackout.",
      "date": "2026-01-08T20:28:44.000Z"
    },
    {
      "text": "Iranian state TV is now reporting on the protests, calls the protesters \"murderous terror cells\" aimed on killing civilians",
      "date": "2026-01-08T20:57:48.000Z"
    },
    {
      "text": "Tehran, Kaj Sa’adat Abad Square: footage shows police equipment burning. Locals claim parts of the city are slipping from government control.",
      "date": "2026-01-08T20:46:45.000Z"
    },
    {
      "text": "Protesters in Tehran set fire to a memorial plaque honoring Qasem Soleimani and IRGC commanders.",
      "date": "2026-01-08T20:41:05.000Z"
    },
    {
      "text": "Large crowd of protesters in Isfahan, Iran tonight - Manoto",
      "date": "2026-01-08T20:26:31.000Z"
    },
    {
      "text": "Tehran, Iran: motorcycles set ablaze.",
      "date": "2026-01-08T20:07:28.000Z"
    },
    {
      "text": "Most videos from Iran are a few hours late. Little new footage is coming out as there is a total internet blackout across the country. Rumours are trickling through of clashes and gunfire in various cities\n\nI believe today's protests are the largest since the 2009/2010 protests.",
      "date": "2026-01-08T19:59:33.000Z"
    },
    {
      "text": "Mashhad, Iran: Protests continue to grow.",
      "date": "2026-01-08T19:34:44.000Z"
    },
    {
      "text": "BREAKING: AP reports telephone lines have been cut in Iran.",
      "date": "2026-01-08T19:30:53.000Z"
    },
    {
      "text": "Attempts to reach Iran by landline and mobile phone from Dubai were unsuccessful. Such outages have previously been followed by intensified state crackdowns, according to AP.",
      "date": "2026-01-08T19:33:13.000Z"
    },
    {
      "text": "Faytuks Network: Updated map the of protests across Iran.",
      "date": "2026-01-08T19:22:33.000Z"
    },
    {
      "text": "Karaj, Iran (Gohardasht): Locals say Iranian security forces are firing at protesters.",
      "date": "2026-01-08T19:21:20.000Z"
    },
    {
      "text": "Trump blames \"stampedes\" for deaths in Iranian protests, says not sure if he can \"hold anyone responsible\" for the 57+ killed since the protests began",
      "date": "2026-01-08T19:15:37.000Z"
    },
    {
      "text": "BREAKING: A local source affiliated with PJAK tell us PJAK fighters are inside Iran fighting. PJAK is a Kurdish militant group opposed to Iran’s government and linked to the PKK.",
      "date": "2026-01-08T18:44:02.000Z"
    },
    {
      "text": "PJAK, the Kurdistan Free Life Party, is designated as a terrorist organization by the United States. The group is a Kurdish militant organization operating mainly in western Iran and is closely linked to the PKK",
      "date": "2026-01-08T18:48:42.000Z"
    },
    {
      "text": "TRUMP: Says the U.S. will hit Iran “hard” if protesters are killed.",
      "date": "2026-01-08T18:36:51.000Z"
    },
    {
      "text": "Iranian Telegram channels is urging supporters in Greater Tehran to escalate actions overnight, including attempts to take over government buildings.",
      "date": "2026-01-08T18:31:32.000Z"
    },
    {
      "text": "Tehran, Iran: Reports of gunfire in the capital.",
      "date": "2026-01-08T18:23:22.000Z"
    },
    {
      "text": "Tasnim, an IRGC-affiliated outlet, claimed tonight’s protests were “very small.” Minutes later, Tasnim went offline.",
      "date": "2026-01-08T18:22:02.000Z"
    },
    {
      "text": "Locals claim an IRGC member was injured during clashes after allegedly firing at protesters.",
      "date": "2026-01-08T18:20:35.000Z"
    },
    {
      "text": "Mehr News (Iranian state-affiliated media) reports Iran is not relying on the Basij tonight and is instead deploying IRGC Ground Forces into major cities. The IRGC Ground Forces’ core mission is regime protection, not routine policing.",
      "date": "2026-01-08T18:11:00.000Z"
    },
    {
      "text": "The website of Iran's official state news agency IRNA is down",
      "date": "2026-01-08T18:10:12.000Z"
    },
    {
      "text": "Gorgan, Iran (Golestan Province): Locals say the provincial governor’s office building was set on fire",
      "date": "2026-01-08T18:02:17.000Z"
    },
    {
      "text": "BREAKING: Iranian state media says two members of the IRGC's Ground Forces have been killed in a \"battle with separatist forces\" in the Iranian city of Kermanshah",
      "date": "2026-01-08T17:59:34.000Z"
    },
    {
      "text": "Video shows one of the crowds gathered in Tehran, Iran.",
      "date": "2026-01-08T17:55:04.000Z"
    },
    {
      "text": "Farrokhshahr, Iran: Locals say protesters set fire to an Islamic seminary (a religious school for clerics).",
      "date": "2026-01-08T17:50:10.000Z"
    },
    {
      "text": "BREAKING: Netblocks confirms Iran is in a nationwide internet blackout, the third nationwide blackout in Iranian history",
      "date": "2026-01-08T17:41:53.000Z"
    },
    {
      "text": "Narmak Square (45), Tehran: Locals say Iranian security forces retreated.",
      "date": "2026-01-08T17:40:06.000Z"
    },
    {
      "text": "Saadat Abad Square, Tehran: Videos shows something on fire with a limited presence of Iranian security forces.",
      "date": "2026-01-08T17:36:59.000Z"
    },
    {
      "text": "Tabriz, Iran (Shahnaz): Reports of unrest/clashes in the area.",
      "date": "2026-01-08T17:33:16.000Z"
    },
    {
      "text": "Andimeshk, Iran: Reports of street clashes ongoing",
      "date": "2026-01-08T17:32:18.000Z"
    },
    {
      "text": "Faytuks Network: New map showing the protests across Iran",
      "date": "2026-01-08T17:18:55.000Z"
    },
    {
      "text": "Nasim Shahr, Iran: Locals say tear gas is used",
      "date": "2026-01-08T17:14:50.000Z"
    },
    {
      "text": "BREAKING: Faytuks Network has visually confirmed 57 protest-related deaths in Iran since the unrest began.\n\nOne video we reviewed showed Iranian security forces shooting three protesters in cold blood.",
      "date": "2026-01-08T17:01:19.000Z"
    },
    {
      "text": "Protests across Iran have noticeably intensified in size and violence throughout the day and into the night.",
      "date": "2026-01-08T16:48:36.000Z"
    },
    {
      "text": "WATCH: Footage of a car ramming security forces in the Iranian city of Mashhad",
      "date": "2026-01-08T15:56:48.000Z"
    },
    {
      "text": "BREAKING: Cloudflare radar announces that Iranian IPv6 networks have been completely cut off from the global internet- effectively blocking all Iranian mobile users from the global internet",
      "date": "2026-01-08T14:46:43.000Z"
    },
    {
      "text": " Confirmed: Network data show the loss of connectivity on #Iran internet backbone provider TCI in the restive city of Kermanshah as protests spread across the nation in their 12th day; the incident comes amid rising casualties with indications of disruptions in multiple regions",
      "date": "2026-01-08T15:22:13.000Z"
    },
    {
      "text": " Protesters today looted the offices of Bank Keshavarzi (linked to the IRGC) in Lumar, Ilam Province, Iran.\n\n Geolocation: 33.56496, 46.81524\n\n@GeoConfirmed @FaytuksNetwork \n\n1/2",
      "date": "2026-01-08T10:20:58.000Z"
    },
    {
      "text": "Iranian man climbs tower in Shirvan, North Khorasan to destroy a security camera.",
      "date": "2026-01-08T14:32:40.000Z"
    },
    {
      "text": "Large convoy of Iranian security forces seen in Borujerd, Iran, headed towards an ongoing protest in the city.\n\nCoordinates: around 33.903514, 48.729654",
      "date": "2026-01-08T14:14:04.000Z"
    },
    {
      "text": "Pro-Regime supporters in Ilam, Iran.\n\nC: 33.625188, 46.410174\nS:https://x.com/PresstvExtra/status/2009244948760285647…\n\n@GeoConfirmed @FaytuksNetwork",
      "date": "2026-01-08T13:08:43.000Z"
    },
    {
      "text": "NEW: Two Iran-aligned armed factions in Iraq sent a letter to Washington that denied any alliegance to Iran, emphasized that the United States is not \"an enemy state,\" and said they do not consider themselves at war with Israel - Iraqi outlet Al-Mada",
      "date": "2026-01-08T12:44:29.000Z"
    },
    {
      "text": "Videos and photos from across Iran today show the deployment of Iranian security forces in schools and public centers, likely preparing to suppress intense protests tonight.",
      "date": "2026-01-08T12:33:42.000Z"
    },
    {
      "text": "Iran's Foreign Minister arrives in Lebanon, says the \"threat from Israel...has never been greater than it is today.\" He is expected to meet with Hezbollah leaders during his trip.",
      "date": "2026-01-08T11:30:16.000Z"
    },
    {
      "text": "Iranian officials have summoned journalists in Iran, asking them to sign pledges to not report on ongoing protests, which many have refused, receiving threats of arrest in the near future - BBC",
      "date": "2026-01-08T08:43:19.000Z"
    },
    {
      "text": "Israeli military sources tell N12 that Hezbollah maintains an active presence south of the Litani River, including operatives, weapons and infrastructure. The sources say Lebanese army statements “do not reflect the reality on the ground.”",
      "date": "2026-01-08T07:09:05.000Z"
    },
    {
      "text": "A massive Islamic Republic of Iran flag was taken down and tore apart in the city center of Mashhad, Iran's second largest city. Coordinates at 36.311031, 59.653486.",
      "date": "2026-01-07T22:11:16.000Z"
    },
    {
      "text": "BREAKING: Faytuks Network has visually confirmed 49 protest-related deaths in Iran since the unrest began.",
      "date": "2026-01-07T18:32:07.000Z"
    },
    {
      "text": "Security forces are opening fire on protesters in Kerman, #Iran \n\nhttps://t.me/iliaen/2333",
      "date": "2026-01-07T18:25:34.000Z"
    },
    {
      "text": "Chinese independent refiners are expected to replace halted Venezuelan crude with heavy grades including Iran in coming months - Reuters",
      "date": "2026-01-07T17:47:22.000Z"
    },
    {
      "text": "Russia has released its first statement since this morning’s boarding and seizure of the Russian-flagged Iranian-linked oil tanker, Marinera, by U.S. Special Forces in the Northern Atlantic. The Russian Ministry of Transport states: “In accordance with the provisions of the 1982",
      "date": "2026-01-07T15:52:37.000Z"
    },
    {
      "text": "NEW: Australia calls on its citizens to leave Iran immediately",
      "date": "2026-01-07T12:16:11.000Z"
    },
    {
      "text": "An analysis of the upcoming Iranian budget from Amwaj indicates that real government civilian spending will decrease by 38%, and over $10B in subsidies for bread, wheat and gasoline will be eliminated, in part to help pay for a $7 monthly stipend",
      "date": "2026-01-07T06:59:49.000Z"
    },
    {
      "text": "The Iranian Foreign Minister, Abbas Araghchi, will visit Lebanon on Thursday, for the first time since the Lebanese Foreign Minister refused to visit Iran. Araghchi is expected to meet with Hezbollah leaders, and the Lebanese Foreign Ministry does not view the visit as a goodwill",
      "date": "2026-01-07T06:46:48.000Z"
    },
    {
      "text": "NEW: Iranian officials increasingly questioning whether US will launch Venezuela-style operation against Iranian officials, including Supreme Leader Khamenei - AP",
      "date": "2026-01-07T06:07:15.000Z"
    },
    {
      "text": "Iranian state television aired unusual claims that the US and Israel had prepared plans to capture Iranian officials with a team of dual-national Iranians - AP",
      "date": "2026-01-07T06:12:25.000Z"
    },
    {
      "text": "IDF sources say a planned strike plan against Hezbollah was ready and would have been launched were it not for developments in Iran, adding that preparations were complete and U.S. approval had been secured. - ynet",
      "date": "2026-01-07T06:02:33.000Z"
    },
    {
      "text": "BREAKING: The U.S. is pressing Venezuela to partner exclusively with Washington on oil and to sever ties with China, Russia, Cuba and Iran - ABC",
      "date": "2026-01-07T00:01:20.000Z"
    },
    {
      "text": "Stickers popping up all over Iran which say “Trump Iran is waiting for you”",
      "date": "2026-01-06T23:37:22.000Z"
    },
    {
      "text": "Security forces opening fire on protesters in Neyriz, in Fars Province, Iran.\n\nGeolocation: 29.19989, 54.32730",
      "date": "2026-01-06T19:43:49.000Z"
    },
    {
      "text": " Security forces opened fire on protesters this evening in Neyriz, in Fars Province, Iran.\n\n Geolocation: 29.19989, 54.32730\n\n@GeoConfirmed @FaytuksNetwork \n\n1/2",
      "date": "2026-01-06T19:43:58.000Z"
    },
    {
      "text": "Police van on fire in Ilam, Iran\n\nGeolocation: 33.642624, 46.422973",
      "date": "2026-01-06T19:34:06.000Z"
    },
    {
      "text": "Police van on fire in Ilam, Iran\n\nC: 33.642624, 46.422973\nS: https://x.com/mojahedin_plus/status/2008620195917795744…\n\n@GeoConfirmed @FaytuksNetwork",
      "date": "2026-01-06T19:34:19.000Z"
    },
    {
      "text": "Faytuks Network: New map showing the protests across Iran.",
      "date": "2026-01-06T17:33:36.000Z"
    },
    {
      "text": "List:\nShiraz, Isfahan, Malard, Karaj, Zahedan, Kermanshah, Tehran, Mashhad, Shush, Hamadan, Dargahan, Najafabad, Yazd, Gorgan, Kerman, Arak, Nurabad, Foladshahr, Urmia, Izeh, Malayer, Shahrekord, Kazeroon, Farsan, Ahvaz, Sabzevar, Fasa, Dehloran, Asadabad, Ramhormoz, Shirvan,",
      "date": "2026-01-06T17:35:39.000Z"
    },
    {
      "text": "BREAKING: Faytuks Network tally shows protests have been reported in at least 110 cities and towns across Iran since the unrest began.",
      "date": "2026-01-06T17:14:52.000Z"
    },
    {
      "text": "Shiraz, Iran: Reports claim a car drove into a group of security-force motorcyclists near the Cinema Saadi/Paramount area.\n\n No independent confirmation yet.\n\nhttps://t.me/kianmeli1/76463",
      "date": "2026-01-06T17:07:45.000Z"
    },
    {
      "text": "Abdanan, Ilam Province, Iran: Video shows police waving at demonstrators.",
      "date": "2026-01-06T16:29:45.000Z"
    },
    {
      "text": "Kurdistan (Iran): The Dialogue Center representing seven Kurdish political parties is calling for a nationwide strike on Thursday, Jan. 8, 2026, protesting the Islamic Republic’s crackdown on demonstrations.",
      "date": "2026-01-06T16:27:59.000Z"
    },
    {
      "text": "Protesters breaking into a bank in Arkavaz, Ilam Province Iran\n\nGeolocation: 33.385068, 46.600162 (@andynovy)",
      "date": "2026-01-06T15:55:06.000Z"
    },
    {
      "text": "Protesters in Arkavaz, Ilam Provice, Iran\n\nGeolocation: 33.385030 46.599856 (@andynovy)",
      "date": "2026-01-06T15:46:22.000Z"
    },
    {
      "text": "Tehran, Iran: Tear gas was fired into the entrance of Sina Hospital.",
      "date": "2026-01-06T13:31:17.000Z"
    },
    {
      "text": "Venezuela opposition leader Maria Corina Machado says Delcy Rodríguez is an ally of Russia, China, and Iran and “is not to be trusted.”",
      "date": "2026-01-06T02:38:38.000Z"
    }
  ]
}